"""
Если из правильного арифметического выражения вычеркнуть всё, кроме круглых скобок,
то получится правильная скобочная последовательность. Проверьте, является ли
введённая строка правильной скобочной последовательностью.

Формат ввода
Вводится непустая строка, состоящая из открывающих и закрывающих круглых скобок.
Длина строки не превосходит 100000

Формат вывода
Выведите YES если введённая строка является правильной скобочной последовательностью
и NO иначе
"""

input_string = input()


def bracket_pairs(string: str) -> str:
    if not string or string[0] == ')':
        return 'NO'

    symb_sum = 0
    for symb in string:
        if symb == '(':
            symb_sum += 1
        else:
            symb_sum -= 1

    if symb_sum == 0:
        return 'YES'
    return 'NO'


print(bracket_pairs(input_string))
